Repository: pock/pock
Catalog: Pock/UI/Languages/*.lproj/Localisations.strings
Languages: ru

# general.welcome-to-pock
source: Welcome to Pock
ru: Добро пожаловать в Pock

# general.pock-widgets-manager
source: Widgets manager for MacBook's Touch Bar
ru: Менеджер виджетов для MacBook с Touch Bar

# menu.general
source: General
ru: Основные

# menu.about
source: About Pock
ru: О Pock

# menu.preferences
source: Preferences…
ru: Настройки…

# menu.widgets
source: Widgets
ru: Виджеты

# menu.widgets.manage-widgets
source: Manage widgets…
ru: Управление виджетами…

# menu.widgets.install-widget
source: Install widget…
ru: Установка виджетов…

# menu.customization
source: Customisation
ru: Персонализация

# menu.customization.pock
source: Customize Pock…
ru: Изменить Pock…

# menu.customization.control-strip
source: Customize Control Strip…
ru: Изменить Control Strip…

# menu.advanced
source: Advanced
ru: Продвинутые

# menu.advanced.re-install-default-widgets
source: Re-install default widgets…
ru: Переустановка стандартных виджетов…

# menu.advanced.open-widgets-folder
source: Open widgets folder…
ru: Открыть папку с виджетами…

# menu.advanced.reload_pock
source: Reload Pock…
ru: Перезагрузить Pock…

# menu.advanced.relaunch_pock
source: Relaunch Pock…
ru: Перезапустить Pock…

# menu.advanced.reload_touchbar
source: Reload Control Strip…
ru: Перезагрузить Control Strip…

# menu.advanced.relaunch_touchbar
source: Relaunch Touch Bar…
ru: Перезапустить Touch Bar…

# menu.developers
source: Developers
ru: Разработка

# menu.advanced.show_debug_console
source: Show debug console…
ru: Показать консоль для отладки…

# menu.goodbye
source: Goodbye
ru: До свидания

# menu.quit
source: Quit Pock
ru: Закрыть Pock

# onboard.title
source: Get the Most Out of Your MacBook Pro Touch Bar
ru: Получите максимум от своего MacBook Pro с Touch Bar

# onboard.body
source: Pock comes with default widgets that let you access the most essential information and functionality of your frequently used controls and services.
ru: Pock содержит стандартные виджеты, которые позовляют взаимодейтсвовать и получать полезную информацию из ваших часто используемых настроек и сервисов.

# onboard.footer
source: Follow the instructions in the Touch Bar to install default widgets
ru: Следуйте инcтрукциям на Touch Bar для установки стандартных виджетов

# onboard.open-preferences
source: Open Preferences…
ru: Открыть Настройки…

# onboard.continue-with-default-settings
source: Continue with default settings
ru: Продолжить со стандартными опциями

# preferences.window.title
source: Preferences
ru: Настройки

# preferences.general.title
source: General
ru: Основные

# preferences.general.allow-blank-touchbar.title
source: Allow blank Touch Bar
ru: Пустой Touch Bar

# preferences.general.allow-blank-touchbar.desc
source: If enabled, you can turn the Touch Bar completely off just by removing any added widgets.
ru: Если включено, вы можете полностью выключить Touch Bar, удалив все добавленные виджеты.

# preferences.general.launch-at-login
source: Launch at login
ru: Запускать при входе в систему

# preferences.layout.title
source: Layout
ru: Расположение

# preferences.double-control.title
source: Switch to default Touch Bar
ru: Вернуться к стандартному Touch Bar

# preferences.double-control.desc
source: Double press `^Control` key to toggle between Pock and System Touch Bar.
ru: Для переключения меджу Pock с Системным Touch Bar, дважды нажмите клавишу `^Control`.

# preferences.default-touchbar.shows
source: Default Touch Bar shows:
ru: Стандартный АFTouch Bar показывает:

# preferences.default-touchbar.desc
source: To work properly, Pock may override the default Touch Bar preferences. You can always configure default settings from `System Preferences > Keyboard` to adapt the Touch Bar to your needs.
ru: Для удобства, Pock может перезаписать настройки стандартного Touch Bar. Вы всегда можете управлять стандартными настройками через `System Preferences > Keyboard` для настройки Touch Bar под ваши задачи.

# preferences.cursor-options.title
source: Cursor options
ru: Опции курсора

# preferences.cursor-options.enable-mouse-support
source: Enable cursor support
ru: Разрешить поддержку курсора

# preferences.cursor-options.show-tracking-area
source: Show tracking area
ru: Показывать поле для взаимодействия

# preferences.updates.check-for-updates-once-a-day
source: Check for updates once a day
ru: Проверять обновления раз в день

# preferences.updates.already-on-latest-version.title
source: Installed version: %@
ru: Установленная версия: %@

# preferences.updates.already-on-latest-version.message
source: Pock is already running on latest version.
ru: У Вас установлена самая последняя версия Pock.

# preferences.updates.new-version-available.title
source: A new version is available
ru: Доступна новая версия

# preferences.updates.new-version-available.message
source: Would you like to update Pock from version %@ to version %@?
ru: Вы хотели бы обновить ваш Pock версии %@ до %@?

# layout-style.show-control-strip
source: Show Control Strip
ru: Показать Control Strip

# layout-style.full-width
source: Full width
ru: Полная ширина

# widgets-manager.list.title
source: Widgets Manager
ru: Менеджер виджетов

# widgets-manager.list.select-widget
source: Select a widget from the list
ru: Выберите виджет из списка

# widgets-manager.list.will-be-updated
source: "%@" widget will be updated
ru: "%@" виджет будет обновлен

# widgets-manager.list.did-update
source: "%@" widget updated. Reload Pock to refresh.
ru: "%@" виджет обновлен. Перезагрузите Pock.

# widgets-manager.loading-preferences
source: Loading Preferences…
ru: Загрузка настроек…

# widgets-manager.list.no-preferences
source: This widget has no preferences
ru: У этого виджета нет настроек

# widgets-manager.list.reset-preferences
source: Reset preferences to default values
ru: Сбросить настройки до первоначальных значений

# widgets.defaults.tap-to-install
source: Tap to install default widgets…
ru: Кликните для установки стандартных виджетов…

# widgets.empty.add-widgets-to-pock
source: Tap to add widgets to Pock…
ru: Кликните чтобы добавить виджет в Pock…

# widget.install.default.title
source: Install default widgets
ru: Установить стандартные виджеты

# widget.install.default.body
source: Would you like to install default widgets?
ru: Вы хотели бы установить стандратные виджеты?

# widget.installing.default.body
source: Processed: %d/%d
ru: Обработано: %d/%d

# widget.installed.default.success.body
source: Default widgets was installed successfully! Click on `Relaunch` to relaunch Pock and enjoy your shiny-new Touch Bar!
ru: Стандартные виджеты были успешно установлены! Нажмите `Перезапустить` чтобы перезапустить Pock и наслаждайтесь вашим новеньким Touch Bar!

# widget.install.drag-here.title
source: Install new widget
ru: Установить новые виджеты

# widget.install.drag-here.body
source: Drag & Drop widget file inside this dialog, or click the `Choose…` button to pick up the file.
ru: Перетащите файл виджета в этот диалог или кликните `Выбрать…` для выбора файла виджета.

# widget.install.drag-here.valid-formats
source: Accepted formats: .pock, .pkarchive
ru: Допустимые форматы: .pock, .pkarchive

# widget.remove.title
source: Remove %@ widget
ru: Удалить %@ виджет

# widget.remove.body
source: Would you like to proceed and remove %@ widget?
ru: Продолжить удаление %@ виджета?

# widget.remove.click-to-continue
source: Click "Remove" to continue…
ru: Для продолжения, кликните "Удалить"…

# widget.install.title
source: Install %@ widget
ru: Установить %@ виджет

# widget.install.body
source: Would you like to proceed and install %@ widget?
ru: Продолжить установку %@ виджета?

# widget.install.click-to-continue
source: Click "Install" to continue…
ru: для продолжения, кликните "Установить"…

# widget.update.title
source: New version available for %@ widget!
ru: Новая версия доступна для %@ виджета!

# widget.update.body
source: Would you like to upgrade from version %@ to the new version %@?
ru: Продолжить обновление версии %@ на новую %@?

# widget.update.changelog.title
source: Changelog:
ru: Лог изменений:

# widget.removing.title
source: Removing %@ widget…
ru: Удаляю %@ виджет…

# widget.removing.body
source: This process can take some time…
ru: Это может занять некоторое время…

# widget.installing.title
source: Installing %@ widget…
ru: Устанавливаю %@ виджет…

# widget.installing.body
source: This process can take some time…
ru: Это может занять некоторое время…

# widget.downloading.title
source: Downloading %@ widget…
ru: Скачиваю %@ виджет…

# widget.downloading.body
source: This process can take some time… Calculating estimated progress:
ru: Это может занять некоторое время… Рассчитываю предполагаемый прогресс:

# widget.remove.error.title
source: Widget removing has failed!
ru: Удаление виджета неудалось!

# widget.install.error.title
source: Widget installation has failed!
ru: Установка виджета неудалось!

# widget.error.title
source: Something went wrong…
ru: Что-то пошло не так…

# widget.error.body
source: An error occured during the process. %@
ru: Во время процесса произошла ошибка. %@

# widget.remove.success.title
source: Widget successfully removed!
ru: Виджет успешно удален!

# widget.remove.success.body
source: Great, %@ widget was completely removed. Click on `Relaunch` to relaunch Pock.
ru: Отлично, %@ виджет был полностью удален. Нажмите `Relaunch` для перезапуска Pock.

# widget.install.success.title
source: What a success!
ru: Вот это успех!

# widget.install.success.body
source: Congratulations, %@ widget is now ready to be added to the Touch Bar. Reload Pock and then click on `Customize Pock…` option to personalize your widgets experience.
ru: Поздравляю, теперь %@ виджет может быть добавлен на Touch Bar. Перезагрузите Pock и кликните `Изменить Pock…` опцию.

# widget.update.success.title
source: Done!
ru: Готово!

# widget.update.success.body
source: Congratulations, %@ widget is now updated to the latest version. Click on `Relaunch` to relaunch Pock.
ru: Поздравляю, теперь %@ виджет обновлен до самой последней версии. Нажмите `Перезапуск` чтобы перезапустить Pock.

# general.action.cancel
source: Cancel
ru: Отмена

# general.action.start
source: Start
ru: Старт

# general.action.choose
source: Choose…
ru: Выбрать…

# general.action.remove
source: Remove
ru: Удалить

# general.action.removing
source: Removing…
ru: Удаление…

# general.action.install
source: Install
ru: Установить

# general.action.installing
source: Installing…
ru: Установка…

# general.action.later
source: Maybe later
ru: Попробуйте позже

# general.action.update
source: Update
ru: Обновить

# general.action.downloading
source: Downloading…
ru: Скачивание…

# general.action.check-for-updates
source: Check for updates
ru: Проверить обновление

# general.action.checking
source: Checking…
ru: Проверяю…

# general.action.close
source: Close
ru: Закрыть

# general.action.reload
source: Reload
ru: Перезагрузить

# general.action.relaunch
source: Relaunch
ru: Перезапустить

# general.action.customize
source: Customize
ru: Изменить

# error.unknown
source: Unknown error occured.
ru: Произошла неизвестная ошибка.

# error.cant-copy
source: File can't be copied to destination folder. %@
ru: Файл не может быть скопирован в заданную директорию. %@

# error.cant-remove
source: Widget file can't be removed. %@
ru: Файл виджета не может быть удален. %@

# error.unknown-server-error
source: Unknown
ru: Неизвестная

# error.updater.invalid-endpoint-url
source: Invalid URL.
ru: Некорректный URL.

# error.updater.response-error
source: Invalid response from the server: %@
ru: Некорректный ответ от сервера: %@

# error.updater.parsing-error
source: Invalid response data.
ru: Некорректные данные в ответе.

# error.updater.invalid-core-version
source: A new version for this widget is available, but your version of Pock is not supported. Please, update to the minimum supported version (%@) to install this widget's version.
ru: Доступна новая версия этого виджета, но ваша версия Pock неподдерживает ее. Пожалуйста, обновите до минимально подерживаемой версии (%@) для установки этой версии виджета.

# error.downloader.invalid-file-url
source: Can't find requested file on remote server.
ru: Невозможно найти запрошенный файл на удаленно сервере.

# error.downloader.response-error
source: Can't request file. Server response: %@
ru: Невозможно запросить файл. Ответ сервера: %@

# error.downloader.download-error
source: Can't download requested file: %@
ru: Невозможно скачать запрошенный файл: %@

# error.file-system-error
source: Can't manage file: %@ Please, check app permission and try again.
ru: Невозможно управлять файлом: %@ Проверьте доступ, данный программе и попробуйте снова.

# debug.console.floating-window
source: Floating window
ru: Плавающее окно

# debug.console.show-on-launch
source: Show on launch
ru: Показывать при запуске

# debug.console.scroll-automatically
source: Scroll automatically
ru: Прокручивать автоматически

# debug.console.clear-console
source: Clear console
ru: Отчистить консоль
